<script setup lang="ts">
import ArticleTemplate from '@/components/ArticleTemplate.vue';
</script>
<template>
    <ArticleTemplate>
        <h1>这里是关于作者的一小部分自述。</h1>
        <p>首先，有关于我注销b站账号和注销klpbbs账号的原因……</p>
        <p>是的，我被网暴了！事情是我有一天，在《某一个小群》里，《某人》说PCL2不好用，有没有谁给他推荐一些新的启动器？</p>
        <p>我毫不犹豫的说：来用LLL启动器吧！【因为在此之前，LLL启动器已经更新到1.0.0-Beta-5了，已经非常完善了！因此我才敢说这种话。】</p>
        <p>但此时此刻，他却说了一句让我非常心寒的话：“得了吧，那启动器又丑又难用，也没见过有多好看的启动器……你就是作者吧，听说你还在启动器里放了病毒，这谁还敢用啊”</p>
        <p>你们知道我当时有多伤心吗？不好意思没有人知道……包括秋风残叶老师也不知道这件事。况且这句话还是在那个《百人小群》里直接发的。我肯定知道他看了MCBBS Wiki，然后看过我的黑历史了嘛。。</p>
        <p>我当场我就回了一句：“你用过吗？你就说难用！况且我放过病毒吗？不懂不要乱说！”</p>
        <p>然后，他就说：“我看了klpbbs你发的那个帖子，超版都已经发了前MCBBS版主给你的评分记录了，而且老早之前我也看过你在MCBBS发的反馈帖，我对这个启动器的印象早就低至谷底。你还敢在这个群里宣传你的启动器？我没联系minebbs的管理员把你帖子删了就不错了！这个群谁敢用他启动器，我就禁言谁”</p>
        <p>上面那段话是他发的（原话是被拆成好几句发的，在这里我整合了一下。</p>
        <p>唉，如果有一次后悔的机会，我一定不会再发我启动器到任何论坛上了……但是既然已经发了，那没事了！就这样吧！</p>
        <p>我启动器我有好几次都想直接摆了，不更新了。但是看在我自己的小群里还有20来人不断支持我，我还是不忍心……于是我打算改名了，改一个网络昵称，改一个你们所有人都不知道的网络昵称！之前剩哲伪旺那个不要也罢！甚至连砖需这个昵称我都可以抛弃！【除了我的英文名以外】</p>
        <p>改名之前，我会先把我启动器更完，更完之后，我就改名了。然后再退出我之前进的所有群聊，如果还可以的话，再以小号方式进入（因为我还是舍不得他们！舍不得各位！</p>
        <p>我承认我是个感情用事的人，我很在乎朋友，真的很在乎，不管是网络上还是现实中，我真的特别重视！我……我真的不想失去朋友，但是事实就是，我不得不再次失去他们……</p>
        <p>记得之前初高中的时候，我在班里经常被排斥，没有人愿意和我玩。这也让我养成了一定要重视自己遇到过的所有朋友的情感。或许正因如此，我才能走到今天吧……</p>
        <p>截至本博客发出之日，LLL启动器已经更新到1.0.0-Beta-7了。再过大概两个版本左右，我就更新正式版了。更完正式版的那一天，也许就是我正式说再见的那一天吧……</p>
        <p>LLL启动器正式停更！现在请参阅我的<a href="https://github.com/PCL-Community/PCL2-Newer-Project" target="_blank">PCL2-Newer-Project！</a></p>
    </ArticleTemplate>
</template>
<style scoped lang="scss">
</style>