<script setup lang="ts">
import ArticleTemplate from '@/components/ArticleTemplate.vue';
</script>
<template>
    <ArticleTemplate>
        <h1>世界观所使用的语言</h1>
        <h2>世界语言特性一览</h2>
        <p>该世界采用了一种很独特的语言，中文称为：【红语】，英文称为：【Red Language】。</p>
        <p>在红语里面，所有的文字均只表示一个意思，不可能出现同义词或者同义字又或者多音字或者多音词这种。</p>
        <p>我们众所周知的【主谓宾】在这里不适用。因为在他们的眼里，只有谓语和宾语，主语没有了。</p>
        <p>比如说在中文，我们说：【我爱你】，他们可能会说：【爱爱你】。他们会将谓语连读两遍来表达由“我”作为主语的一部分。</p>
        <p>那如果说是：【你爱我】呢？他们可能会说【爱爱爱你】。他们会将谓语连读三遍来表达由“你”作为主语。</p>
        <p>那如果是：【他】呢？很明显，他们会将谓语连读四遍来表达由“他”作为主语。</p>
        <p>比如说英文里：【I love you】，他们只会读成【love love you】。</p>
        <p>那什么情况下只读一遍呢？我们会发现，当很多时候，如果遇到了【只有谓语和宾语】的情况下，只读一遍。比如说中文里的：【给我】，他们只会读一遍。</p>
        <p>但实际情况是，他们其实会在谓语中多加一点点音节来判定人称关系。很多时候并不需要读三次甚至四次，只有在专业的书籍里，他们才会这么写。</p>
        <p>比如中文里的【我爱你】，英文里本来是【I love you】，他们可能会读成：【lovi you】，将最后一个“e”读成“i”。</p>
        <p>或者是中文里的【你爱我】，英文里本来是【you love me】，他们可能会读成【lovo me】，将最后一个“e”读成“o”。</p>
        <p>同时，他们的语言其实和中文一样，无论是主语还是宾语，无论是第一人称还是第三人称，他们只有一个称呼。比如【我】就是【我】，无论主格还是宾格。</p>
        <p>他们的语言并不用空格作为区分，他们也并不使用标点符号。他们有属于他们自己的注记词。</p>
        <p>打个比方，我们使用【我问你，你有没有笔？】，他们可能会说：【我问你呀你有没有笔呢】最后一个问号变为了呢，中间的逗号换成了呀。这里的我我只是为了方便，不想说成【问问你呀】这种说法罢了捏！包括以下的时态讲解我都采用了中文的人称表示。我不采用谓谓谓语以及等等谓语的形式来说。</p>
        <p>在他们的眼里，注记词永远只是个注记词，不可能表示具体含义。他们的每一种文字都有确切的含义。比如：【问】这个字，在中文里有动词和名词，还有英文里的【fire】，既有【开火】也有【火焰】的意思。甚至英文还有动名词表现形式。</p>
        <p>学完了人称后，下面我们来学一下时态。</p>
        <p>而他们，在表达任何时态以及任何词性时，均使用注记符来表示，比如说我想说：【我昨天喝了酒】，现在将【过去】标记为【b】，他们可能会说【b1我喝了酒】，意思就是过去我喝了酒。</p>
        <p>又比如我想表示过去完成时，我会说：【当我跑到公交车站时，公交车已经走掉了。】他们会这样标记：【b1我跑到公交车站呀b2公交车走掉了】其中，b1不再表示过去一天了，而是表示【当时】的意思。而b2的意思，指的是用了两次过去时，这个已经的意思就说再我跑到之前就已经走掉了。因此使用了b2。</p>
        <p>如果想表示确切的时间，比如说中文里的：【就在昨天的11：30，我摔了一跤】。他们可能会说：【b1在11：30我摔了一跤】。此时你可能会有疑惑，11：30别人是怎么知道在昨天的呢？正如我上面说的，【我昨天喝了酒】，只用一个b1是不知道在昨天的。</p>
        <p>此时就用到了我们的注记符了，在表示确切的时间时，他们会这样说：【b1一天11：30我摔了一跤】。我们上面把【天】标记成日期中的【天数】。但是我们是不知道是昨天还是明天的，因此他们会在天前面加上数字，然后前面加上b1表示过去时，就可以了。比如上面的b1一天，就代表了昨天。因此上面的【b1我喝了酒】可以表示成【b1一天我喝了酒】。</p>
        <p>在他们的语言中，这种b1的表示方式，是非常常见的。同样的，用中文注记符来说，我们也可以给他们的将来时做个标记。比如说a1代表了将来。</p>
        <p>比如说我想表示过去将来时，中文我们会说：【如果你昨天不喝酒，我今天就不会打你了！】。请用红语翻译以下上面这段话，限时1分钟，尽量不要看参考答案：</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>好啦，给你们看参考答案，翻译成红语大概如这：【b1一天你不喝酒，a1我不会打你了】。很简单，当b放在a的前面时，表示的是过去将来时。</p>
        <p>那如果我们想表示将来完成时呢？请看例句：【等到了明天，我就有钱买新玩具了！】请翻译成红语，限时1分钟，尽量不要看参考答案：</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>很简单，把a放在前面就行了。这个的意思大概就是：【a1一天等到了呀b1我有钱买新玩具呢】。意思就是a将来，b指的是将来某个时候已经完成了前面的事情。</p>
        <p>在红语里，没有明、昨这些概念，只有注记词。</p>
        <p>那你们可能会问了，如果我想表示【现在完成进行时】，也就是【我一直在等他，但是他一直没出来。】，此时应该如何翻译？限时1分钟，尽量不要看参考答案：</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>我们此时不应该用a或者b了，这些显然不能处理以上的意思。不过我们可以再加个注记词，称为c，代表了持续发生的事情。</p>
        <p>此时，有了c就好办了，翻译成红语应该是【c1等他呀但是他没出来】，前面和后面两个【一直】很明显是表示同一个意思。前面如果要加个人称的话，应该是【c1等等他】，但为了中文，我们还是说成【c1我等他】吧。</p>
        <p>然后，就是我们的高级句式啦！首先我需要给你们看个例句：【到了今年8月份，他就20岁了！】这个语句表示的是【过去将来完成进行时】，在红语中我们应该如何表述呢？限时1分钟，尽量不要看参考答案：</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>给个小提示：用一个a和一个c就可以解决了！</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>好吧，正确答案是：【a1到了八月呀c1他就二十岁】，但其实正确的语序不是这样的，正确的语序是：【a1八月到了呀c1二十岁他就】，因为注记符后面跟着的一定是具体的值。</p>
        <p>这里在红语里可以省略掉【他就】，因为在实际沟通中，我可以指定手势来判断此时我说的是谁。比如说我指着对面那个人，说【a1八月到了呀c1二十岁】，意思就是他二十岁了。如果指代目前不在场的人的话，我们还可以从他前面说的话来判断人称。</p>
        <p>此时各位应该会发现，如果我们的注记符后面加上了具体的值包括天、月、年这种，则认为这个注记符一定是代表着时态。如果后面跟着的不是天、月、年，则要根据实际情况来判断。在红语里面的注记符有很多种，不只有时态这种噢~</p>
        <p>好了，现在我们学会了基本的时态和人称词了，现在我们来学习关联句式。比如说“虽然……但是……”和“因为……所以……”这种。</p>
        <p>在【红语】里面，这些语句其实很简单就可以学会。比如说我想表示“虽然……但是……”这种词汇。我们很容易就能看出，这是在【前一个句子未完成的时候，后面的句子突然间完成的，或者是无意识完成的。但是也算是用别样的方式完成了任务】。</p>
        <p>比如说：【我虽然没有喝水，但是我喝了果汁】。这种语句就代表了虽然但是。我们在红语里是直接使用现有的文字来表示的。比如说虽然，在红语里翻译成“Although”【假设】，那么就是：【Although我没有喝水呀我喝了果汁】。</p>
        <p>还有因为所以这个句式，我们也可以用英文的手法来打入，比如说【Because你打了我呀我打你】这种语句。</p>
        <p>红语和英文很像的一点就在于这里，在红语里，我们的关联句和英文很像。</p>
        <p>好，学完了关联句，下面我们来简单了解从句。比如说定语从句这种。</p>
        <p>比如说：【I know a man who is tall】，中文翻译为：【我认识一个很高的男人】。在红语里，我们可以标记定语从句里的who为t。我们可以这样写：【我认识一男人t1很高】。当然，正如同英文和中文里，多个句子可以表示同一含义那样，我们也可以说成：【我认识一很高男人】，这样就能省略了定语从句的t了。甚至英文也可以翻译成【I know a tall man】</p>
        <p>不过在红语里，也有专门表示定语从句的注记符。如同上面的t一般。</p>
        <p>宾语从句的话。宾语就是宾语，例如【我不知道现在还有没有公交车】，翻译成英文可以说成：【I don’t know if there is a bus now】，这里的if就是宾语从句的一部分，将后面的there is a bus now构成了宾语从句。在红语里，他们一般这样说【我不知道a1有没有公交车】，用一个简单的将来注记符，就可以表示了。意思就是现在还没等到公交车，也不知道将来会不会有公交车。</p>
        <p>现在请将下面中文翻译成红语：【他告诉我他将在明年买房子】，限时1分钟，尽量不要看参考答案：</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>|</p>
        <p>上述中文翻译成红语的意思是：【他告诉我a1一年他买房子】。同样的，我们也会发现，上述英文既可以翻译成：【he told me that he would buy a new house next year】，也可以省略that。在英文里，我们时常可以省略掉宾语从句里的that。而在红语里，则根本不会有宾语从句的注记符。因为它又与中文很像。</p>
        <p>请注意，但是在日常沟通中，他们并不会将注记符读出来，他们仅在写书面语的时候写上注记符，在交流时，他们一般根据语义来自我推断时态、语态等。</p>
        <p>在上述自动推断时态语态这种，我可以给个中文的很好理解的句子：【那时的我，一定是很高很壮的小伙子啦！】和【那时的我，还是个青涩的小男孩呢！】，请告诉我上述两个“那时”分别代表过去还是将来？</p>
        <p>很明显，第一个句子表示将来，第二个句子表示过去。这也是我们为什么可以通过语义来自动判断时态的原因。</p>
        <p>好了，接下来的【中文<->红语】的字典，请参阅我的爱发电获取吧，我会详细的把每个字和每个词的中文意思和红语意思写出来。</p>
        <p><a href="https://afdian.com/a/xphost" target="_blank">参阅我的爱发电</a></p>
    </ArticleTemplate>
</template>
<style scoped lang="scss">
</style>