<script setup lang="ts">
import ArticleTemplate from '@/components/ArticleTemplate.vue'
</script>
<template>
    <ArticleTemplate>
        <h2>这个世界正在变得黑暗，请各位一定要保护好自己，不要<del>被杀了</del>~~</h2>
        <p><b>该游戏分为8个dlc，有一个免费的本体。本体本身并不能玩，只有拥有了8个dic中的任意一个才能开始游玩。</b></p>
        <p><b>以下是8个dlc分别的背景介绍。对比前面的世界观，你应该能看出里面的部分内容~</b></p>
        <h3>1. 鲁空——双翅龙族</h3>
        <p>此时，世界被一个王统治着，这个王虽然说非常精明能干，但是非常懦弱，因此不免有许多人觊觎它的职位。我们没有办法，只能听天由命了。</p>
        <p>王啊！你为什么如此懦弱！王啊！你为什么甘愿堕落！王啊！你为什么……</p>
        <p>爸爸曾经对我说过：“鲁空！这并不是王自己的错，是他的懦弱造就了他的一生。你要好好学习，将来成王！”</p>
        <p>“可是，成王到底有什么好处？就算成了王，也管不了世界的每个角落啊？”</p>
        <p>“世界本就是一体的，再这样下去迟早要分化了！每个种族的矛盾激发，到时候我们要逃到哪里去啊？”</p>
        <p>“逃？我们还能逃到哪里去？”</p>
        <p>“你想要改变这一切吗？让我问你一个问题吧——”</p>
        <h3>2. 秋叶——双翅龙族</h3>
        <p>这个世界的王已经崩溃，他开始被狼族的一个人所威胁着。威胁着他当上了傀儡王！</p>
        <p>王，本身就是个贬义词，如果不是特别需要，谁会去当上这该死的职位？</p>
        <p>他身边已经全部都是乱臣贼子，这个国家要完蛋了！</p>
        <p>他回想到，那一天坐在秋叶身边的老者对他说：“你知道这个世界的走向吗？”</p>
        <p>“我猜世界很快就会分崩离析，不出10年，世界将会开展一次巨大的战争。”</p>
        <p>“哦？你说这些要是被王听到了，那可是要杀头的！”</p>
        <p>“难道我说的不对吗？”</p>
        <p>“很好，那么让我来问你一个问题——”</p>
        <h3>3. 魁——虎族</h3>
        <p>“警长！我不行了！”一名警员小声的说道。</p>
        <p>“再挺一下，马上就过去了。”魁大声吼道。</p>
        <p>“王，请保佑我们，我们必须为了我们的族群所战斗！”</p>
        <p>狼族已然开始攻打其他族，依靠着这个傀儡王，他们一路上一帆风顺。</p>
        <p>而魁，却依然在以王为本去祈祷。他对此毫无能力。</p>
        <p>他曾经也是当上过警队优秀队长的人啊！怎么能在这里就退缩呢？他不允许自己就这么死去，他要战斗，要为了自己的族群而战！</p>
        <p>他的胸膛被刺穿，他的脑袋被摔晕。他奄奄一息的躺在病床上。脑子里却还想着他的战友。</p>
        <p>此时，一名老者缓缓走了进来，问他：“你是否想要改变这一切？”</p>
        <p>他何时不想啊！他缓缓张开口，说道：“我想……我想改变！”</p>
        <p>老者轻蔑一笑：“那，让我来问你一个问题——”</p>
        <h3>4. 凯飞——鳄鱼族</h3>
        <p>作为鳄鱼族最细的工匠，他每天都为家人们缝制衣物，他虽然有一身肌肉，但是手法精细到无话可说。</p>
        <p>但是，自从战争开始后，他便归隐山中了。无论有任何人去找他，都闭门不见。</p>
        <p>他曾经最好的朋友“杜锋”是这样描述他的：</p>
        <p>“曾经那些时候，他每天都非常开心，笑着迎接每一个人。是那个王！该死的王啊！你为什么要这么堕落！”</p>
        <p>“我不知道，如果当初的人民发现自己选上的王是多么的懦弱，会不会很后悔啊！不，不会的，他们只会嘲笑他！”</p>
        <p>而凯飞，此时正在自己的山间小屋里，嚎啕大哭着。</p>
        <p>他不明白，战争夺走了他的父母，夺走了他的伴侣外，究竟还想再从他的手里夺走什么？</p>
        <p>此时，他的门响了。他走过去，大声说道：“我……我不欢迎任何人！”</p>
        <p>门外传来一阵鬼叫，听起来很像狼族的怪笑，外面的人小声说道：“凑过来点，我不进来，我只是想问你一个问题——”</p>
        <h3>5. 鹿衍——鹿族</h3>
        <p>柳玉程是她的非常要好的闺蜜。她们以前几乎每天都在一起。但直到小柳找到了伴侣之后，她们便被迫分道扬镳了。</p>
        <p>战争来临了！她当上了士兵。当士兵唯一的好处就是，有津贴补发。</p>
        <p>由于战争的到来，致使全球通货膨胀非常严重，一些以前很便宜的商品被炒到天价。她也有着迫不得已的理由去战斗。</p>
        <p>她别无他求，她只想回到那和平年代。但是事与愿违，她迫不得已参军。她何曾不想好好的过日子啊！</p>
        <p>直到那一天的到来，彻底的打乱了她的生活计划。</p>
        <p>她在闲暇之余，来到曾经的海边，望着远方的夕阳，此时，身边来了一个人。</p>
        <p>那个人很大声的问道：“在这里干什么？”</p>
        <p>“哈哈，在这里看看远方的景色。曾经也是那么的美啊！”</p>
        <p>“那，让我来问你一个问题——”鹿衍转过头，发现了令她此生难忘的一幕。</p>
        <h3>6. 霆——鹰族</h3>
        <p>“外面怎么这么嘈杂？”霆推开门，发现外面堆满了尸体，那是何等的恐怖啊！</p>
        <p>此时，他的右边传来一个声音，那是狼族的声音！那个狼族大声吼道：“快来啊！这里有人！快杀了他！”</p>
        <p>他一听就直到这是在说自己。他头也没回，立刻钻回家中，锁好门后躲在门后，准备给来着当头一棒。</p>
        <p>不一会，那该死的狼族就将门狠狠的砸碎了。他冲进来四处观望。不料，霆在背后用一根大木棒狠狠的击中了狼族的头部。</p>
        <p>狼族士兵嗷呜一声叫，顺势倒在了地上。霆冲过去，用爪子狠狠钳住狼士兵的手，说道：“告诉我，外面发生什么事了？”</p>
        <p>狼族哈哈大笑：“什么事？你们的王垮台啦！哈哈哈！现在是狼族人的天下，你有本事就杀了我，我保证我们的新王不会放过你的！”</p>
        <p>“等等，你说，王垮台了？”</p>
        <p>“这样，你放了我，我告诉你一点秘密。”</p>
        <p>鹰爪终于松开了士兵的手臂，此时士兵的手臂开始往外渗血。不过他毫不在意，他说道：“既然你放了我，那我来问你一个问题——”</p>
        <h3>7. 远洋——鲨龙族</h3>
        <p>他从小到大都生活在水里，几乎很少上岸。世界上的王甚至逐渐的忘记了这个种族。</p>
        <p>直到战争的炮火攻入水中时，他才意识到事情的严重性。他被迫上岸了。</p>
        <p>他循着记忆的方向，找到了他曾经的玩伴“鲁空”的家。但此时，鲁空早已搬走，人去楼空。</p>
        <p>他不明白，为什么王这么的堕落？确实，他现在还小，还非常不懂事。他盲目的在龙族土地上走着，走着。</p>
        <p>是啊，从记事开始，龙族就一直不受待见，可这凭什么？凭狼族一家独大吗？</p>
        <p>他找了个角落，不断地哭泣，哭泣着。抱怨着世间的不公平。</p>
        <p>他的父母为了将他送上岸，拼尽了全力，最终死在了炮火之下。他大吼道：“天！为什么要这么对我？”</p>
        <p>他的身后突然多了一道声音：“小弟，你在这干什么？”</p>
        <p>“我……我不知道。。”</p>
        <p>身后那道声音笑了笑，小声嘀咕道：“就他了！”，那道声音突然大声说到：“来，让我问你一个问题——”</p>
        <h3>8. 长毛（大毛、二毛、三毛）——三头犬</h3>
        <p>“狼族？哈哈哈！狼族算什么好汉？”左边那个头说道。</p>
        <p>“说到底，也不过是我们的棋子罢了！”中间那个头说道。</p>
        <p>“哎呀呀，王又怎样？到时候世界都是我们的了，还愁什么呢？”右边那个头说道。</p>
        <p>嗯哼，不过我还是有点事情没想明白。中间那个头开始思考一个问题。</p>
        <p>其他两个头都在高声论阔，唯独中间那个头在想：“世间总有光明与邪恶，那为什么邪恶永远也不会胜利？”</p>
        <p>中间那个头突然间回过神，说道：“喂，你俩，我问你们一个问题——”</p>
        <h3>后记：</h3>
        <p>在以上的8个人里，没有一个人见过真正的王，他们只能知道关于王的特征，比如说“王是非常懦弱的、王是非常堕落的”等等。</p>
        <p>在上述语记中，我并没有挑明王的具体种族。具体有关王的一说，请参阅游戏。</p>
        <p>如果觉得我写得好的，别忘了进我的<a href="https://afdian.com/a/xphost">爱发电</a>为我助力一下啦！</p>
    </ArticleTemplate>
</template>
<style scoped lang="scss">
</style>